In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings("ignore")

## Using Matplotlib and Seaborn it Will be fun

In [4]:
df = pd.read_csv("coffeeSales.csv")
df.head(3)

,Date,Customer_ID,City,Category,Product,Unit Price,Quantity,Sales Amount,Used_Discount,Discount_Amount,Final Sales
0,1/1/2023,32,Riyadh,coffee beans,Colombian,40,14,560,False,0,560
1,1/2/2023,49,Abha,coffee beans,Costa Rica,35,17,595,False,0,595
2,1/3/2023,75,Tabuk,coffee beans,Costa Rica,35,19,665,False,0,665

Change the names of the columns to camelCapital

In [6]:
df = df.rename(columns={"Customer_ID": "ID", "Unit Price": "UnitPrice", "Sales Amount": "SalesAmount",
                         "Used_Discount": "UsedDiscount", "Discount_Amount": "DiscountAmount", "Final Sales": "FinalSales"})
df.head(3)

,Date,ID,City,Category,Product,UnitPrice,Quantity,SalesAmount,UsedDiscount,DiscountAmount,FinalSales
0,1/1/2023,32,Riyadh,coffee beans,Colombian,40,14,560,False,0,560
1,1/2/2023,49,Abha,coffee beans,Costa Rica,35,17,595,False,0,595
2,1/3/2023,75,Tabuk,coffee beans,Costa Rica,35,19,665,False,0,665

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            730 non-null    object
 1   ID              730 non-null    int64
 2   City            730 non-null    object
 3   Product         730 non-null    object
 4   UnitPrice       730 non-null    int64
 5   Quantity        730 non-null    int64
 6   SalesAmount     730 non-null    int64
 7   UsedDiscount    730 non-null    int64
 8   DiscountAmount  730 non-null    int64
 9   FinalSales      730 non-null    int64
dtypes: int64(7), object(3)
memory usage: 57.2+ KB

In [16]:
df.nunique()

Date              730
ID                100
City               10
Product             5
UnitPrice           4
Quantity           49
SalesAmount       149
UsedDiscount        2
DiscountAmount    134
FinalSales        243
dtype: int64

In [9]:
df.drop('Category', axis=1, inplace=True)
df.head(3)

,Date,ID,City,Product,UnitPrice,Quantity,SalesAmount,UsedDiscount,DiscountAmount,FinalSales
0,1/1/2023,32,Riyadh,Colombian,40,14,560,False,0,560
1,1/2/2023,49,Abha,Costa Rica,35,17,595,False,0,595
2,1/3/2023,75,Tabuk,Costa Rica,35,19,665,False,0,665

In [12]:
df.Product.unique()

array(['Colombian', 'Costa Rica', 'Ethiopian', 'Brazilian', 'Guatemala'],
      dtype=object)

In [15]:
df['UsedDiscount'] = df['UsedDiscount'].astype(int)
df.head(3)

,Date,ID,City,Product,UnitPrice,Quantity,SalesAmount,UsedDiscount,DiscountAmount,FinalSales
0,1/1/2023,32,Riyadh,Colombian,40,14,560,0,0,560
1,1/2/2023,49,Abha,Costa Rica,35,17,595,0,0,595
2,1/3/2023,75,Tabuk,Costa Rica,35,19,665,0,0,665

In [18]:
df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            730 non-null    datetime64[ns]
 1   ID              730 non-null    int64
 2   City            730 non-null    object
 3   Product         730 non-null    object
 4   UnitPrice       730 non-null    int64
 5   Quantity        730 non-null    int64
 6   SalesAmount     730 non-null    int64
 7   UsedDiscount    730 non-null    int64
 8   DiscountAmount  730 non-null    int64
 9   FinalSales      730 non-null    int64
dtypes: datetime64[ns](1), int64(7), object(2)
memory usage: 57.2+ KB

In [19]:
df.head(3)

,Date,ID,City,Product,UnitPrice,Quantity,SalesAmount,UsedDiscount,DiscountAmount,FinalSales
0,2023-01-01,32,Riyadh,Colombian,40,14,560,0,0,560
1,2023-01-02,49,Abha,Costa Rica,35,17,595,0,0,595
2,2023-01-03,75,Tabuk,Costa Rica,35,19,665,0,0,665